swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* Define the flexspi macro. Note that it can't be modified here */
#define IOMUXC_GPIO_AD_B1_00_FLEXSPI_A_DATA03 0x401F80FCU, 0x1U, 0x401F8374U, 0x1U, 0x401F8270U
#define IOMUXC_GPIO_AD_B1_01_FLEXSPI_A_SCLK 0x401F8100U, 0x1U, 0x401F8378U, 0x1U, 0x401F8274U
#define IOMUXC_GPIO_AD_B1_02_FLEXSPI_A_DATA00 0x401F8104U, 0x1U, 0x401F8368U, 0x1U, 0x401F8278U
#define IOMUXC_GPIO_AD_B1_03_FLEXSPI_A_DATA02 0x401F8108U, 0x1U, 0x401F8370U, 0x1U, 0x401F827CU
#define IOMUXC_GPIO_AD_B1_04_FLEXSPI_A_DATA01 0x401F810CU, 0x1U, 0x401F836CU, 0x1U, 0x401F8280U
#define IOMUXC_GPIO_AD_B1_05_FLEXSPI_A_SS0_B 0x401F8110U, 0x1U, 0, 0, 0x401F8284U

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitPins(void);
void configurePinAD_B1_15AsGPIO(void);
void configurePinAD_B1_15AsSPI3MISO(void);


//#define RK3568_ARK_REV_1_0_MOD  
/* Rev 1.0 mods: label taken led mod moved to emc_39 */ 
#define RK3568_ARK_REV_2_0_MOD
/******************************************************************************/    
/************************ rt1024-global scale *********************************/
/********************* sbc-rk3568-nxp24-ark rev 2.0 ***************************/        
/* Rev 2.0 changes from rev 1.0: 
      Pin:              From Signal:            To Signal:
    gpio_emc_09         LabelTakenEnable        LabelTakenLED
    gpio_emc_08         Spare                   ModelTypeIOB
    gpio_sd_b1_11       LabelTakenLED           LabelTakenEnable
    gpio_sd_b1_10       Spare                   StatusLedEnable
    gpio_sd_b1_09       Spare                   Logo2LedEnable
    gpio_sd_b1_08       Spare                   LogoLedEnable
    gpio_sd_b1_05       ModelTypeIOB            Spare
    gpio_ad_b0_08       Spare                   IDF1
    gpio_ad_b0_07       Spare                   IDF2
    gpio_ad_b1_06       Spare                   StatusLed2
    gpio_emc_22         Uart2Tx                 BootCFG
    gpio_emc_23         Uart2Rx                 BootCFG
*/ 
/******************************************************************************/
/********************************** weigher ***********************************/
/******************************************************************************/

#define WEIGHER_SPI_CLK_GPIO                            GPIO2
#define WEIGHER_SPI_CLK_PORT                            GPIO2
#define WEIGHER_SPI_CLK_PIN                             10U            

#define WEIGHER_SPI_MOSI_GPIO                           GPIO2
#define WEIGHER_SPI_MOSI_PORT                           GPIO2
#define WEIGHER_SPI_MOSI_PIN                            13U            

#define WEIGHER_SPI_MISO_GPIO                           GPIO2
#define WEIGHER_SPI_MISO_PORT                           GPIO2
#define WEIGHER_SPI_MISO_PIN                            12U            

#define WEIGHER_DATA_RDY_GPIO                           GPIO2
#define WEIGHER_DATA_RDY_PORT                           GPIO2
#define WEIGHER_DATA_RDY_PIN                            12U

#define WEIGHER_SPI_CS_GPIO                             GPIO2
#define WEIGHER_SPI_CS_PORT                             GPIO2
#define WEIGHER_SPI_CS_PIN                              11U            

#define WEIGHER_CLK_PWM_GPIO                            GPIO2
#define WEIGHER_CLK_PWM_PORT                            GPIO2
#define WEIGHER_CLK_PWM_PIN                             26U            

#define WGR_RESET_GPIO                                  GPIO3
#define WGR_RESET_PORT                                  GPIO3
#define WGR_RESET_PIN                                   5U

#define SERVICE_SWITCH_GPIO                             GPIO2
#define SERVICE_SWITCH_PORT                             GPIO2
#define SERVICE_SWITCH_PIN                              6U

#define ACCEL_I2C_SCL_PORT                              GPIO2    /* shared accel and lp5521 */   
#define ACCEL_I2C_SCL_GPIO                              GPIO2
#define ACCEL_I2C_SCL_PIN                               2U 

#define ACCEL_I2C_SDA_PORTx                             GPIO2
#define ACCEL_I2C_SDA_GPIOx                             GPIO2
#define ACCEL_I2C_SDA_PINx                              3U

#define ACCEL_SPI_CLK_GPIO                              GPIO1
#define ACCEL_SPI_CLK_PORT                              GPIO1
#define ACCEL_SPI_CLK_PIN                               28U

#define ACCEL_SPI_CS_GPIO                               GPIO1
#define ACCEL_SPI_CS_PORT                               GPIO1
#define ACCEL_SPI_CS_PIN                                29U

#define ACCEL_SPI_MOSI_GPIO                             GPIO1
#define ACCEL_SPI_MOSI_PORT                             GPIO1
#define ACCEL_SPI_MOSI_PIN                              30U

#define ACCEL_SPI_MISO_GPIO                             GPIO1
#define ACCEL_SPI_MISO_PORT                             GPIO1
#define ACCEL_SPI_MISO_PIN                              31U

#define ACCEL_INTA_PORT                                 GPIO2
#define ACCEL_INTA_GPIO                                 GPIO2
#define ACCEL_INTA_PIN                                  14U

