swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.h
#define ACCEL_INTB_PORT                                 GPIO2
#define ACCEL_INTB_GPIO                                 GPIO2
#define ACCEL_INTB_PIN                                  15U

#define ACCEL_PWR_EN_GPIO                               GPIO3
#define ACCEL_PWR_EN_PORT                               GPIO3
#define ACCEL_PWR_EN_PIN                                23U      //IOMUXC_GPIO_SD_B1_03_GPIO3_IO23

/******************************************************************************/
/******************************** communication *******************************/
/******************************************************************************/

#define RS485_TX_GPIO                                   GPIO1
#define RS485_TX_PORT                                   GPIO1
#define RS485_TX_PIN                                    10U

#define RS485_RX_GPIO                                   GPIO1
#define RS485_RX_PORT                                   GPIO1
#define RS485_RX_PIN                                    11U

#define CAN_TX_GPIO                                     GPIO3          
#define CAN_TX_PORT                                     GPIO3          
#define CAN_TX_PIN                                      20U
              
#define CAN_RX_GPIO                                     GPIO3                  
#define CAN_RX_PORT                                     GPIO3              
#define CAN_RX_PIN                                      21U 

#define USB_PWR_EN_GPIO                                 GPIO3
#define USB_PWR_EN_PORT                                 GPIO3
#define USB_PWR_EN_PIN                                  9U

#define USB_OTG1_ID_GPIO                                GPIO3
#define USB_OTG1_ID_PORT                                GPIO3
#define USB_OTG1_ID_PIN                                 8U

#define CUTTER_UART_TX_GPIO                             GPIO1
#define CUTTER_UART_TX_PORT                             GPIO1
#define CUTTER_UART_TX_PIN                              6U

#define CUTTER_UART_RX_GPIO                             GPIO1
#define CUTTER_UART_RX_PORT                             GPIO1
#define CUTTER_UART_RX_PIN                              7U

/******************************************************************************/
/********************************** printer ***********************************/   
/******************************************************************************/

#define PHEAD_SPI_CLK_GPIO                              GPIO3
#define PHEAD_SPI_CLK_PORT                              GPIO3
#define PHEAD_SPI_CLK_PIN                               0U

#define PHEAD_SPI_DATA_GPIO                             GPIO3
#define PHEAD_SPI_DATA_PORT                             GPIO3
#define PHEAD_SPI_DATA_PIN                              3U

#define PHEAD_LATCH_GPIO                                GPIO2
#define PHEAD_LATCH_PORT                                GPIO2
#define PHEAD_LATCH_PIN                                 0U

#define PHEAD_STROBE_A_GPIO                             GPIO3
#define PHEAD_STROBE_A_PORT                             GPIO3
#define PHEAD_STROBE_A_PIN                              6U

#define PHEAD_STROBE_B_GPIO                             GPIO3
#define PHEAD_STROBE_B_PORT                             GPIO3
#define PHEAD_STROBE_B_PIN                              22U

#define PHEAD_STROBE_EN_GPIO                            GPIO2
#define PHEAD_STROBE_EN_PORT                            GPIO2
#define PHEAD_STROBE_EN_PIN                             1U

#define PHEAD_POWER_EN_GPIO          	                GPIO2
#define PHEAD_POWER_EN_PORT          	                GPIO2
#define PHEAD_POWER_EN_PIN                              4U

#define PHEAD_DOT_ENABLE_GPIO          	                GPIO2    
#define PHEAD_DOT_ENABLE_PORT          	                GPIO2
#define PHEAD_DOT_ENABLE_PIN                            5U

#define PHEAD_DETECT_GPIO          	                GPIO1    
#define PHEAD_DETECT_GPIO_PORT          	        GPIO1
#define PHEAD_DETECT_GPIO_PIN                           15U


/******************************************************************************/
/********************************** motors ************************************/   
/******************************************************************************/

#define MAIN_MOTOR_SLEEP_GPIO                           GPIO3
#define MAIN_MOTOR_SLEEP_PORT                           GPIO3
#define MAIN_MOTOR_SLEEP_PIN                            4U

#define TAKEUP_MOTOR_MS0_GPIO                           GPIO2
#define TAKEUP_MOTOR_MS0_PORT                           GPIO2
#define TAKEUP_MOTOR_MS0_PIN                            16U

#define TAKEUP_MOTOR_MS1_GPIO                           GPIO2
#define TAKEUP_MOTOR_MS1_PORT                           GPIO2
#define TAKEUP_MOTOR_MS1_PIN                            17U

#define TAKEUP_MOTOR_RESET_GPIO                         GPIO2
#define TAKEUP_MOTOR_RESET_PORT                         GPIO2
#define TAKEUP_MOTOR_RESET_PIN                          18U

#define TAKEUP_MOTOR_EN_GPIO                            GPIO2
#define TAKEUP_MOTOR_EN_PORT                            GPIO2
#define TAKEUP_MOTOR_EN_PIN                             19U

#define TAKEUP_MOTOR_DIR_GPIO                           GPIO2
#define TAKEUP_MOTOR_DIR_PORT                           GPIO2
#define TAKEUP_MOTOR_DIR_PIN                            20U

#define TAKEUP_MOTOR_STEP_GPIO                          GPIO2
#define TAKEUP_MOTOR_STEP_PORT                          GPIO2
#define TAKEUP_MOTOR_STEP_PIN                           21U

#define TAKEUP_MOTOR_SLEEP_GPIO                         GPIO2
#define TAKEUP_MOTOR_SLEEP_PORT                         GPIO2
#define TAKEUP_MOTOR_SLEEP_PIN                          24U

#define MAIN_MOTOR_MS0_GPIO                             GPIO2
#define MAIN_MOTOR_MS0_PORT                             GPIO2
#define MAIN_MOTOR_MS0_PIN                              25U

#define MAIN_MOTOR_MS1_GPIO                             GPIO2
#define MAIN_MOTOR_MS1_PORT                             GPIO2
#define MAIN_MOTOR_MS1_PIN                              27U

#define MAIN_MOTOR_RESET_GPIO                           GPIO2
#define MAIN_MOTOR_RESET_PORT                           GPIO2
#define MAIN_MOTOR_RESET_PIN                            28U

#define MOTOR_EN_GPIO                                   GPIO2
#define MOTOR_EN_PORT                                   GPIO2
#define MOTOR_EN_PIN                                    29U 

#define MAIN_MOTOR_DIR_GPIO                             GPIO2            
#define MAIN_MOTOR_DIR_PORT                             GPIO2
#define MAIN_MOTOR_DIR_PIN                              30U

#define MAIN_MOTOR_STEP_GPIO                            GPIO2
#define MAIN_MOTOR_STEP_PORT                            GPIO2
#define MAIN_MOTOR_STEP_PIN                             31U

/******************************************************************************/
/********************************** misc io ***********************************/   
/******************************************************************************/

#define SERIAL_FlASH_CS_GPIO                            GPIO3
#define SERIAL_FlASH_CS_PORT                            GPIO3
#define SERIAL_FlASH_CS_PIN                             16U    


#define LP5521_EN_GPIO                                  GPIO2
#define LP5521_EN_PORT                                  GPIO2
#define LP5521_EN_PIN                                   7U


#ifdef RK3568_ARK_REV_1_0_MOD 

#define LABEL_TAKEN_LED_GPIO                            GPIO2
#define LABEL_TAKEN_LED_PORT                            GPIO2
#define LABEL_TAKEN_LED_PIN                             21U

#else 

#ifdef RK3568_ARK_REV_2_0_MOD

#define LABEL_TAKEN_LED_GPIO                            GPIO2
#define LABEL_TAKEN_LED_PORT                            GPIO2
#define LABEL_TAKEN_LED_PIN                             9U

#else 

#endif

#endif

#define LABEL_TAKEN_EN_PORT                             GPIO3                         
#define LABEL_TAKEN_EN_GPIO                             GPIO3
#define LABEL_TAKEN_EN_PIN                              31U

#define SRAM_CS_GPIO                                    GPIO3
#define SRAM_CS_PORT                                    GPIO3
#define SRAM_CS_PIN                                     1U

