swiftat-itwfeg/UnifiedGTXproRT1024/bootloader/board/pin_mux.h
#define SRAM_MISO_GPIO                                  GPIO3
#define SRAM_MISO_PORT                                  GPIO3
#define SRAM_MISO_PIN                                   2U

#define MODEL_TYPE_A_GPIO                               GPIO3                             
#define MODEL_TYPE_A_PORT                               GPIO3
#define MODEL_TYPE_A_PIN                                24U

#define MODEL_TYPE_B_GPIO                               GPIO2                               
#define MODEL_TYPE_B_PORT                               GPIO2
#define MODEL_TYPE_B_PIN                                8U

#define MODEL_TYPE_C_GPIO                               GPIO3                               
#define MODEL_TYPE_C_PORT                               GPIO3
#define MODEL_TYPE_C_PIN                                26U

#define MODEL_TYPE_D_GPIO                               GPIO3                               
#define MODEL_TYPE_D_PORT                               GPIO3
#define MODEL_TYPE_D_PIN                                27U

#define IDF1_GPIO                                       GPIO1                               
#define IDF1_PORT                                       GPIO1
#define IDF1_PIN                                        8U

#define IDF2_GPIO                                       GPIO1                               
#define IDF2_PORT                                       GPIO1
#define IDF2_PIN                                        9U

#define HEART_BEAT_LED_GPIO                             GPIO3          
#define HEART_BEAT_LED_PORT                             GPIO3           
#define HEART_BEAT_LED_PIN                              14U  

#define LOGO_EN1_LED_GPIO                               GPIO3          
#define LOGO_EN1_LED_PORT                               GPIO3           
#define LOGO_EN1_LED_PIN                                29U  

#define LOGO_EN_LED_GPIO                                GPIO3          
#define LOGO_EN_LED_PORT                                GPIO3           
#define LOGO_EN_LED_PIN                                 28U  

#define LOGO_STATUS_LED_EN_GPIO                         GPIO3          
#define LOGO_STATUS_LED_EN_PORT                         GPIO3           
#define LOGO_STATUS_LED_EN_PIN                          30U  

#define STATUS_LED_GPIO                                 GPIO1
#define STATUS_LED_PORT                                 GPIO1           
#define STATUS_LED_PIN                                  22U  

/******************************************************************************/
/********************************** sensors ***********************************/   
/******************************************************************************/

#define LABEL_TAKEN_SENSOR_GPIO                         GPIO1                                         
#define LABEL_TAKEN_SENSOR_PORT                         GPIO1                
#define LABEL_TAKEN_SENSOR_PIN                          13U               

#define LOW_LABEL_STOCK_SENSOR_GPIO                     GPIO1
#define LOW_LABEL_STOCK_SENSOR_PORT                     GPIO1
#define LOW_LABEL_STOCK_SENSOR_PIN                      14U

#define SHOOT_THROUGH_SENSOR_GPIO                       GPIO1
#define SHOOT_THROUGH_SENSOR_PORT                       GPIO1
#define SHOOT_THROUGH_SENSOR_PIN                        23U

#define PAPER_TAKEUP_SENSOR_GPIO                        GPIO1
#define PAPER_TAKEUP_SENSOR_PORT                        GPIO1
#define PAPER_TAKEUP_SENSOR_PIN                         24U

#define PHEAD_THERM_SENSOR_GPIO                         GPIO1
#define PHEAD_THERM_SENSOR_PORT                         GPIO1
#define PHEAD_THERM_SENSOR_PIN                          25U

#define HEAD_UP_SENSOR_GPIO                             GPIO1         	  
#define HEAD_UP_SENSOR_PORT                             GPIO1     	  
#define HEAD_UP_SENSOR_PIN                              26U

#define PHEAD_DOT_GPIO                                  GPIO1         	  
#define PHEAD_DOT_PORT                                  GPIO1     	  
#define PHEAD_DOT_PIN                                   27U

/******************************************************************************/    
/******************************************************************************/    
/******************************************************************************/    
#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
